# git init - инциализация папки (определяем директорию, с которой работаем)
# по умолчанию ветка - master
# git add . (git add -A) - добавить файлы и папки из инициализированной директории
# git commit -m "commentary"- добавляем файлы в проект для отслеживания изменений. -m - для добавления комментария в кавычках
# git status - проверяет наличие изменений в проекте
# git diff - выводит подробную информацию о том какие изменения были внесены
# git log - отслеживает / выводит историю комментариев
# Ветвление - указатель на коммиты (для совместной работы с проектами)
# git branch -a - вывод списка существующих веток. * - указывает на ветку, в которой нахожусь
# git checkout master - перейти в ветку master. Обязательно для создания новых веток
# git checkout -b name - создать новую ветку с именем name